content/softwares/nuts.org
# -*- coding:utf-8-*-
#+TITLE: 坚果云
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com
* 概述
  [[https://www.jianguoyun.com/][坚果云]] 是一个跨平台的文件同步工具。

* 安装

  从[[https://www.jianguoyun.com/s/downloads][下载页面]]下载各操作系统的安装包进行安装。

* 配置

* 使用

** 添加待同步的文件夹

** 增加 linux 操作系统中 inotify 句柄的上限
   当需要同步的文件夹数目很多，或者在同时使用某些常见应用，例如网易云音乐 Linux 版时，可能会碰到坚果云提示 “inotify 句柄超过系统上限” 的问题。 可以参考下面的步骤予以修复：
   #+BEGIN_SRC sh
echo "fs.inotify.max_user_watches=32768" | sudo tee -a /etc/sysctl.conf
sudo sysctl -p /etc/sysctl.conf
   #+END_SRC

** ubuntu 登录报 ssl 链接失败
   原因：一个基于 java 的证书失败。

   解决：
   1. 备份并移除老的 cacerts
      #+BEGIN_SRC
sudo mv /etc/ssl/certs/java/cacerts{,.backup}
      #+END_SRC

   2. 生成新的 cacerts
      #+BEGIN_EXAMPLE
      sudo keytool -importkeystore -destkeystore /etc/ssl/certs/java/cacerts -deststoretype jks -deststorepass changeit -srckeystore /etc/ssl/certs/java/cacerts.backup -srcstoretype pkcs12 -srcstorepass changeit
      #+END_EXAMPLE
