softwares/nuts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 16:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>坚果云</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">坚果云</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54be4c9">1. 概述</a></li>
<li><a href="#org0f4aefa">2. 安装</a></li>
<li><a href="#org348c156">3. 配置</a></li>
<li><a href="#orgba27bc1">4. 使用</a>
<ul>
<li><a href="#org8a5c84d">4.1. 添加待同步的文件夹</a></li>
<li><a href="#org8c23aa5">4.2. 增加 linux 操作系统中 inotify 句柄的上限</a></li>
<li><a href="#org16d7d66">4.3. ubuntu 登录报 ssl 链接失败</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org54be4c9" class="outline-2">
<h2 id="org54be4c9"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.jianguoyun.com/">坚果云</a> 是一个跨平台的文件同步工具。
</p>
</div>
</div>

<div id="outline-container-org0f4aefa" class="outline-2">
<h2 id="org0f4aefa"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
从<a href="https://www.jianguoyun.com/s/downloads">下载页面</a>下载各操作系统的安装包进行安装。
</p>
</div>
</div>

<div id="outline-container-org348c156" class="outline-2">
<h2 id="org348c156"><span class="section-number-2">3</span> 配置</h2>
</div>

<div id="outline-container-orgba27bc1" class="outline-2">
<h2 id="orgba27bc1"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8a5c84d" class="outline-3">
<h3 id="org8a5c84d"><span class="section-number-3">4.1</span> 添加待同步的文件夹</h3>
</div>

<div id="outline-container-org8c23aa5" class="outline-3">
<h3 id="org8c23aa5"><span class="section-number-3">4.2</span> 增加 linux 操作系统中 inotify 句柄的上限</h3>
<div class="outline-text-3" id="text-4-2">
<p>
当需要同步的文件夹数目很多，或者在同时使用某些常见应用，例如网易云音乐 Linux 版时，可能会碰到坚果云提示 “inotify 句柄超过系统上限” 的问题。 可以参考下面的步骤予以修复：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">echo</span> <span style="color: #ff4ea3;">"fs.inotify.max_user_watches=32768"</span> | sudo tee -a /etc/sysctl.conf
sudo sysctl -p /etc/sysctl.conf
</pre>
</div>
</div>
</div>

<div id="outline-container-org16d7d66" class="outline-3">
<h3 id="org16d7d66"><span class="section-number-3">4.3</span> ubuntu 登录报 ssl 链接失败</h3>
<div class="outline-text-3" id="text-4-3">
<p>
原因：一个基于 java 的证书失败。
</p>

<p>
解决：
</p>
<ol class="org-ol">
<li><p>
备份并移除老的 cacerts
</p>
<pre class="example">
sudo mv /etc/ssl/certs/java/cacerts{,.backup}
</pre></li>

<li><p>
生成新的 cacerts
</p>
<pre class="example">
      sudo keytool -importkeystore -destkeystore /etc/ssl/certs/java/cacerts -deststoretype jks -deststorepass changeit -srckeystore /etc/ssl/certs/java/cacerts.backup -srcstoretype pkcs12 -srcstorepass changeit
</pre></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 16:59</p>
<p class="validation"></p>
</div>
</body>
</html>
